# CircuitsOverlapAndDeleteSpareSpace Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CircuitsOverlapAndDeleteSpareSpace Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircuitsOverlapAndDeleteSpareSpace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircuitsOverlapAndDeleteSpareSpace As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircuitsOverlapAndDeleteSpareSpace {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace